# 100 Days of Code: Python Bootcamp - Day 72 - Data Exploration with Pandas

### Import necessary libraries

In [100]:
import pandas as pd
from bs4 import BeautifulSoup
import requests

### Generate dataframe

In [65]:
df = pd.read_csv('salaries_by_college_major.csv')
df = df.dropna()

### Explore data

##### Rows X Columns

In [66]:
df.shape

(50, 6)

In [67]:
df.head()

,Undergraduate Major,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,41600.0,76800.0,50600.0,136000.0,Business

##### List of columns

In [68]:
df.columns

Index(['Undergraduate Major', 'Starting Median Salary',
       'Mid-Career Median Salary', 'Mid-Career 10th Percentile Salary',
       'Mid-Career 90th Percentile Salary', 'Group'],
      dtype='object')

##### Statistical Data

In [69]:
df.describe().round()

,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
count,50.0,50.0,50.0,50.0
mean,44310.0,74786.0,43408.0,142766.0
std,9361.0,16088.0,12001.0,27851.0
min,34000.0,52000.0,26700.0,96400.0
25%,37050.0,60825.0,34825.0,124250.0
50%,40850.0,72000.0,39400.0,145500.0
75%,49875.0,88750.0,49850.0,161750.0
max,74300.0,107000.0,71900.0,210000.0

### Questions to be answered

#### 1) Find the undergraduate course with the highest starting median salary

In [70]:
q1_highest_starting_median_salary_index = df['Starting Median Salary'].idxmax()
q1_course_undergrad_major = df.loc[q1_highest_starting_median_salary_index]['Undergraduate Major']
print(f'The undergraduate major with the highest starting median salary is: {q1_course_undergrad_major}')

The undergraduate major with the highest starting median salary is: Physician Assistant

#### 2) What college major has the highest mid-career salary? How much do graduates with this major earn? (Mid-career is defined as having 10+ years of experience)

In [71]:
q2_highest_midcareer_median_salary_index = df['Mid-Career Median Salary'].idxmax()
q2_highest_midcareer_median_salary = df['Mid-Career Median Salary'].max()
q2_course_undergrad_major = df.loc[q2_highest_midcareer_median_salary_index]['Undergraduate Major']

print(f'The undergraduate major with the highest mid-career median salary is: {q2_course_undergrad_major}, with a salary of ${q2_highest_midcareer_median_salary}')

The undergraduate major with the highest mid-career median salary is: Chemical Engineering, with a salary of $107000.0

#### 3) Which college major has the lowest starting salary and how much do graduates earn after university?

In [72]:
q3_lowest_starting_median_salary_index = df['Starting Median Salary'].idxmin()
q3_lowest_starting_median_salary = df['Starting Median Salary'].min()
q3_course_undergrad_major = df.loc[q3_lowest_starting_median_salary_index]['Undergraduate Major']

print(f'The undergraduate major with the lowest starting median salary is: {q3_course_undergrad_major}, with a salary of ${q3_lowest_starting_median_salary}')

The undergraduate major with the lowest starting median salary is: Spanish, with a salary of $34000.0

#### 4) Which college major has the lowest mid-career salary and how much can people expect to earn with this degree?

In [73]:
q4_lowest_midcareer_median_salary_index = df['Mid-Career Median Salary'].idxmin()
q4_lowest_midcareer_median_salary = df['Mid-Career Median Salary'].min()
q4_course_undergrad_major = df.loc[q4_lowest_midcareer_median_salary_index]['Undergraduate Major']

print(f'The undergraduate major with the lowest mid-career median salary is: {q4_course_undergrad_major}, with a salary of ${q4_lowest_midcareer_median_salary}')

The undergraduate major with the lowest mid-career median salary is: Education, with a salary of $52000.0

### Sorting Values & Adding Columns: Majors with the Most Potential vs Lowest Risk

#### 5) Add "Spread" column

##### "Spread" in this context means the majors with lowest risk, calculated through the difference between the 90th and 10th percentile salaries

In [74]:
spread_col = df['Mid-Career 90th Percentile Salary'] - df['Mid-Career 10th Percentile Salary']
df.insert(1, 'Spread', spread_col)
df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,109800.0,46000.0,77100.0,42200.0,152000.0,Business
1,Aerospace Engineering,96700.0,57700.0,101000.0,64300.0,161000.0,STEM
2,Agriculture,113700.0,42600.0,71900.0,36300.0,150000.0,Business
3,Anthropology,104200.0,36800.0,61500.0,33800.0,138000.0,HASS
4,Architecture,85400.0,41600.0,76800.0,50600.0,136000.0,Business

#### 6) Sort by spread

In [75]:
low_risk = df.sort_values('Spread')
low_risk = low_risk[['Undergraduate Major','Spread']]
low_risk.head()

           Undergraduate Major   Spread
40                     Nursing  50700.0
43         Physician Assistant  57600.0
41                   Nutrition  65300.0
49                     Spanish  65400.0
27  Health Care Administration  66400.0

#### 7) Find the top 5 degrees with the highest values in the 90th percentile.

In [76]:
top5_90th_perc = df.sort_values('Mid-Career 90th Percentile Salary', ascending=False).head()
top5_90th_perc[['Undergraduate Major','Mid-Career 90th Percentile Salary']]

     Undergraduate Major  Mid-Career 90th Percentile Salary
17             Economics                           210000.0
22               Finance                           195000.0
8   Chemical Engineering                           194000.0
37                  Math                           183000.0
44               Physics                           178000.0

#### 8) Which majors have the largest difference between high and low earners after graduation?

In [77]:
top5_spread = df.sort_values('Spread', ascending=False).head()
top5_spread[['Undergraduate Major','Spread']]

   Undergraduate Major    Spread
17           Economics  159400.0
22             Finance  147800.0
37                Math  137800.0
36           Marketing  132900.0
42          Philosophy  132500.0

### Grouping and Pivoting Data with Pandas

#### 9) Groupby function

In [80]:
df.groupby('Group').count()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary
Group,,,,,,
Business,12,12,12,12,12,12
HASS,22,22,22,22,22,22
STEM,16,16,16,16,16,16

####  Find the average salary by group

In [92]:
df.groupby('Group').describe().round(2) 
# using mean() directly returns an error, and it seems it is a pandas 
# bug(https://stackoverflow.com/questions/57331164/groupby-mean-doesnt-work-while-sum-std-and-size-all-work), used therefore describe() instead.

         Spread                                                             \
          count       mean       std      min      25%       50%       75%
Group
Business   12.0  103958.33  33138.15  50700.0  81550.0  109000.0  119250.0
HASS       22.0   95218.18  20394.83  65300.0  75100.0   97900.0  107125.0
STEM       16.0  101600.00  18356.72  57600.0  96500.0   99000.0  112225.0

                   Starting Median Salary            ...  \
               max                  count      mean  ...
Group                                                ...
Business  159400.0                   12.0  44633.33  ...
HASS      132500.0                   22.0  37186.36  ...
STEM      137800.0                   16.0  53862.50  ...

         Mid-Career 10th Percentile Salary           \
                                       75%      max
Group
Business                           48350.0  56300.0
HASS                               36925.0  41200.0
STEM                               64750.0  71900.0

         Mid-Career 90th Percentile Salary                                 \
                                     count       mean       std       min
Group
Business                              12.0  147525.00  35799.17   98300.0
HASS                                  22.0  129363.64  22436.84   96400.0
STEM                                  16.0  157625.00  19293.78  124000.0


               25%       50%       75%       max
Group
Business  120750.0  148500.0  172000.0  210000.0
HASS      108250.0  132500.0  144500.0  168000.0
STEM      147500.0  158500.0  169250.0  194000.0

[3 rows x 40 columns]

#### Format numbers for readability

In [94]:
pd.options.display.float_format = '{:,.2f}'.format 
df.head()

,Undergraduate Major,Spread,Starting Median Salary,Mid-Career Median Salary,Mid-Career 10th Percentile Salary,Mid-Career 90th Percentile Salary,Group
0,Accounting,"109,800.00","46,000.00","77,100.00","42,200.00","152,000.00",Business
1,Aerospace Engineering,"96,700.00","57,700.00","101,000.00","64,300.00","161,000.00",STEM
2,Agriculture,"113,700.00","42,600.00","71,900.00","36,300.00","150,000.00",Business
3,Anthropology,"104,200.00","36,800.00","61,500.00","33,800.00","138,000.00",HASS
4,Architecture,"85,400.00","41,600.00","76,800.00","50,600.00","136,000.00",Business